In [1]:
import numpy as np
import pandas as pd

Import and save CSV and Excel

In [2]:
df = pd.read_csv('example')

In [3]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df.to_csv('example_copy', index=False)

In [5]:
df_copy = pd.read_csv('example_copy')

In [6]:
df_copy

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_excel('example_copy_to_excel.xlsx', index=False, sheet_name='First')

In [8]:
pd.read_excel('example_copy_to_excel.xlsx',sheet_name='First')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

HTML input

pip install lxml
pip install html5lib
pip install BeautifulSoup4

In [9]:
data = pd.read_html('https://en.wikipedia.org/wiki/Minnesota')

In [10]:
data[2]

              Location July (°F) July (°C) January (°F) January (°C)
0          Minneapolis     83/64     28/18         23/7       −4/−13
1           Saint Paul     83/63     28/17         23/6       −5/−14
2            Rochester     82/63     28/17         23/3       −5/−16
3               Duluth     76/55     24/13         19/1       −7/−17
4            St. Cloud     81/58     27/14        18/−1       −7/−18
5              Mankato     86/62     30/16         23/3       −5/−16
6  International Falls     77/52     25/11        15/−6       −9/−21

In [11]:
data[2].to_csv('Minessota', index=False)

In [12]:
minessota = pd.read_csv('Minessota')

In [13]:
minessota

              Location July (°F) July (°C) January (°F) January (°C)
0          Minneapolis     83/64     28/18         23/7       −4/−13
1           Saint Paul     83/63     28/17         23/6       −5/−14
2            Rochester     82/63     28/17         23/3       −5/−16
3               Duluth     76/55     24/13         19/1       −7/−17
4            St. Cloud     81/58     27/14        18/−1       −7/−18
5              Mankato     86/62     30/16         23/3       −5/−16
6  International Falls     77/52     25/11        15/−6       −9/−21

SQL with pandas. Pandas it's not the best way to use SQL

In [14]:
from sqlalchemy import create_engine

In [15]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [16]:
engine = create_engine('sqlite:///:memory:')

In [17]:
df.to_sql('My table', engine)

In [18]:
pd.read_sql('My table', engine)

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15